import re
from datetime import datetime  

text = """1. 感染性心内膜炎最常见的易患因素是  
A. 二尖瓣脱垂  
B. 动脉粥样硬化  
C. 特发性肥厚性主动脉瓣下狭窄  
D. 风湿性心脏瓣膜病  
E. 大面积室间隔缺损  

2. 风湿性心脏病最易合并细菌性心内膜炎的是  
A. 二尖瓣狭窄  
B. 主动脉瓣狭窄  
C. 二尖瓣关闭不全并主动脉瓣关闭不全  
D. 二尖瓣狭窄并关闭不全  
E. 二尖瓣狭窄并肺动脉瓣关闭不全  

3. 下列是感染性心内膜炎的临床表现的是  
A. 奇脉  
B. Koplik 斑  
C. Osler结节  
D. 蝴蝶斑  
E. 雷诺现象  

4. 下述是感染性心内膜炎提示有心肌脓肿心电图表现的是  
A. 房室传导阻滞或室性期前收缩  
B. 房性期前收缩  
C. 实性心动过速  
D. 心房纤颤  
E. 阵发性室上性心动过速  

5. 下列哪项表现对诊断感染性心内膜炎最有意义  
A. 持续高热，体温超过39°C  
B. 心脏杂音的强度和性质有变化  
C. 发热者伴有脾脏肿大  
D. 拔牙后出现口腔黏膜和眼结合膜瘀点  
E. 轻、中度贫血伴有镜下血尿  

6. 风湿性心脏病联合瓣膜病，下列哪种表现对诊断感染性心内膜炎最有力  
A. 体温38.5°C  
B. 胸痛伴有胸膜摩擦音  
C. 血白细胞数增高，核左移  
D. 超声心动图有瓣膜赘生物  
E. 心电图示 ST 段压低，R波增高  

7. 下列关于感染性心内膜炎防治原则的叙述正确的是  
A. 风湿性心脏病病人，每月肌注苄星青霉素一次  
B. 人工瓣膜置换术后病人拔牙时口服抗生素预防感染  
C. 先天性心脏病动脉导管未闭病人上呼吸道感染时，静脉大量应用抗生素  
D. 感染性心内膜治愈病人，膀胱镜检时可不必服用抗生素  
E. 风湿性心脏病心衰病人为预防本病，常规应用抗生素  

8. 引起亚急性感染性心内膜炎最常见的致病菌为  
A. 金黄色葡萄球菌  
B. 肠球菌  
C. 革兰阳性菌  
D. 厌氧菌  
E. 草绿色链球菌  

9. 感染性心内膜炎并发症中最常见的是  
A. 心力衰竭  
B. 细菌性动脉瘤  
C. 动脉栓塞  
D. 心肌脓肿  
E. 急性心肌梗死  

10. 感染性心内膜炎的治疗原则首选  
A. 细菌培养阳性后才用抗生素治疗  
B. 用抑菌抗生素治疗  
C. 及早用大剂量杀菌剂做长期治疗  
D. 及早输血  
E. 体温下降后即可停用抗生素  

11. 对疑有感染性心内膜炎的病人，下述处理原则正确的是  
A. 病人来院后立即应用抗生素，再考虑做血培养  
B. 先行超声心动图检查，有赘生物时大剂量使用抗生素  
C. 体温在38.5%以上时才能抽血做细菌培养  
D. 已用抗生素者需停药2 ~ 7天后抽血做血培养  
E. 为提高血培养阳性率每日抽血一次  

12. 感染性心内膜炎并发症中最常见的是  
A. 心力衰竭  
B. 细菌性动脉瘤  
C. 动脉栓塞  
D. 心肌脓肿  
E. 急性心肌梗死  

13. 治疗感染性心内膜炎最好选用（在细菌培养结果之前）  
A. 庆大霉素  
B. 链霉素  
C. 卡那霉素  
D. 多粘菌素  
E. 青霉素G  

14. 发生于瓣膜置换术后多长时间的感染性心内膜炎可以定义为早期人工瓣膜心内膜炎  
A. 30天内  
B. 60天内  
C. 3个月内  
D. 6个月内  
E. 1年内  

15. 对于静脉药瘾者心内膜炎病人，提示预后不良的因素不包括  
A. 金黄色葡萄球菌感染  
B. 左心瓣膜（尤其是主动脉瓣）受累  
C. 赘生物 > 20mm  
D. 革兰阴性杆菌或真菌感染  
E. HIV感染病人 CD4 细胞计数 < 200个  

16. 引起静脉药瘾者心内膜炎最常见的致病菌为  
A. 草绿色链球菌  
B. 金黄色葡萄球菌  
C. 肠球菌  
D. 革兰阴性菌  
E. 真菌
"""
answer = """1. D 2. C 3. C 4. A 5. B 6. D 7. B 8.E 9. A 10. C

11. D 12.A 13. E 14. E 15. A 16. B"""

clas = "内科学" 
mode = "A1"
tag = ["人卫习题集","习题","章节-感染性心内膜炎"]
# 获取当前时间  
now = datetime.now()  

# 格式化为 yyyy-m-d-H-s  
timestamp = now.strftime("%Y-%m-%d-%H-%S")  

def retain_only_letters(input_string):  
    # 使用正则表达式替换非字母字符  
    result = re.sub(r'[^a-zA-Z]', '', input_string)  
    return result  

test_extract = text.split("\n\n")
answer = retain_only_letters(answer)
tag_string = ""
for i in tag:
    tag_string = tag_string+"  - "+i+"\n"

for i in range(len(test_extract)):
    id = timestamp + "-" + str(i)+".md"
    path = "./tool/extract_result/"
    markdown_content = f"""---
class: {clas}
mode: {mode}
tags:
{tag_string}
---

# Q
{test_extract[i]}
# A
{answer[i]}
# D
"""
    with open(path+id,"w",encoding="utf-8") as md:
        md.write(markdown_content) 

    print("id:",id,"\n",test_extract[i],"\n答案：",answer[i],"\n-----------\n")
